# FilterDoubleRule Properties

---
The FilterDoubleRule type exposes the following members.
| Name| Description
---|---|---
| Epsilon|  The tolerance within which two floating-point values may be considered equal.
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity. (Inherited from FilterRule)
| RuleValue|  The user-supplied value against which values from a Revit document will be tested.
Top
#### Reference
FilterDoubleRule Class
Autodesk.Revit.DB Namespace